#!/bin/bash

printf "\033[38;5;6m"
echo -ne '💸                  \r'
sleep 0.1
echo -ne '💸💸                \r'
sleep 0.1
echo -ne '💸💸💸              \r'
sleep 0.1
echo -ne '💸💸💸💸            \r'
sleep 0.1
echo -ne '💸💸💸💸💸          \r'
sleep 0.1
echo -ne '💸💸💸💸💸💸        \r'
sleep 0.1
echo -ne '💸💸💸💸💸💸💸      \r'
sleep 0.1
echo -ne '💸💸💸💸💸💸💸💸    \r'
sleep 0.1
echo -ne '💸💸💸💸💸💸💸💸💸  \r'
sleep 0.1
echo -ne '💸💸💸💸💸💸💸💸💸💸\r'
sleep 0.1
echo -ne '💸💸💸💸💸💸💸💸💸💸💸\r'
sleep 0.1
echo -ne '💸💸💸💸💸💸💸💸💸💸💸💸\r'
sleep 0.1
echo -ne '💸💸💸💸💸💸💸💸💸💸💸💸💸\r'
sleep 0.1
echo -ne '💸💸💸💸💸💸💸💸💸💸💸💸💸💸\r'
sleep 0.1
echo -ne '💸💸💸💸💸💸💸💸💸💸💸💸💸💸💸\r'
sleep 0.1
echo -ne '\n'